iliasam/Laser_tape_reverse_engineering/Code/CortexM0_STM32G0/Firmware_dist_calculation_simple/Drivers/STM32G0xx_HAL_Driver/Inc/stm32g0xx_ll_flash.h
/**
  ******************************************************************************
  * @file    stm32g0xx_hal_flash.h
  * @author  MCD Application Team
  * @brief   Header file of FLASH HAL module.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2018 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef STM32G0xx_LL_FLASH_H
#define STM32G0xx_LL_FLASH_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32g0xx.h"

/** @addtogroup STM32G0xx_LL_Driver
  * @{
  */

/** @addtogroup FLASH
  * @{
  */

/* Exported types ------------------------------------------------------------*/
/** @defgroup FLASH_Exported_Types FLASH Exported Types
  * @{
  */

/**
  * @brief  FLASH Erase structure definition
  */
typedef struct
{
  uint32_t TypeErase;   /*!< Mass erase or page erase.
                             This parameter can be a value of @ref FLASH_Type_Erase */
  uint32_t Banks;       /*!< Select bank to erase.
                             This parameter must be a value of @ref FLASH_Banks
                             (FLASH_BANK_BOTH should be used only for mass erase) */
  uint32_t Page;        /*!< Initial Flash page to erase when page erase is enabled
                             This parameter must be a value between 0 and (FLASH_PAGE_NB - 1) */
  uint32_t NbPages;     /*!< Number of pages to be erased.
                             This parameter must be a value between 1 and (FLASH_PAGE_NB - value of initial page)*/
} FLASH_EraseInitTypeDef;

/**
  * @brief  FLASH Option Bytes Program structure definition
  */
// typedef struct
// {
//   uint32_t OptionType;        /*!< Option byte to be configured.
//                                    This parameter can be a combination of the values of @ref FLASH_OB_Type */
//   uint32_t WRPArea;           /*!< Write protection area to be programmed (used for OPTIONBYTE_WRP).
//                                    Only one WRP area could be programmed at the same time.
//                                    This parameter can be value of @ref FLASH_OB_WRP_Area */
//   uint32_t WRPStartOffset;    /*!< Write protection start offset (used for OPTIONBYTE_WRP).
//                                    This parameter must be a value between 0 and [FLASH_PAGE_NB - 1]*/
//   uint32_t WRPEndOffset;      /*!< Write protection end offset (used for OPTIONBYTE_WRP).
//                                    This parameter must be a value between WRPStartOffset and [FLASH_PAGE_NB - 1] */
//   uint32_t RDPLevel;          /*!< Set the read protection level (used for OPTIONBYTE_RDP).
//                                    This parameter can be a value of @ref FLASH_OB_Read_Protection */
//   uint32_t USERType;          /*!< User option byte(s) to be configured (used for OPTIONBYTE_USER).
//                                    This parameter can be a combination of @ref FLASH_OB_USER_Type */
//   uint32_t USERConfig;        /*!< Value of the user option byte (used for OPTIONBYTE_USER).
//                                    This parameter can be a combination of
//                                    @ref FLASH_OB_USER_BOR_ENABLE(*),
//                                    @ref FLASH_OB_USER_BOR_LEVEL(*),
//                                    @ref FLASH_OB_USER_RESET_CONFIG(*),
//                                    @ref FLASH_OB_USER_nRST_STOP,
//                                    @ref FLASH_OB_USER_nRST_STANDBY,
//                                    @ref FLASH_OB_USER_nRST_SHUTDOWN(*),
//                                    @ref FLASH_OB_USER_IWDG_SW,
//                                    @ref FLASH_OB_USER_IWDG_STOP,
//                                    @ref FLASH_OB_USER_IWDG_STANDBY,
//                                    @ref FLASH_OB_USER_WWDG_SW,
//                                    @ref FLASH_OB_USER_SRAM_PARITY,
//                                    @ref FLASH_OB_USER_BANK_SWAP(*),
//                                    @ref FLASH_OB_USER_DUAL_BANK(*),
//                                    @ref FLASH_OB_USER_nBOOT_SEL,
//                                    @ref FLASH_OB_USER_nBOOT1,
//                                    @ref FLASH_OB_USER_nBOOT0,
//                                    @ref FLASH_OB_USER_INPUT_RESET_HOLDER(*)
//                                    @note (*) availability depends on devices */
// #if defined(FLASH_PCROP_SUPPORT)
//   uint32_t PCROPConfig;       /*!< Configuration of the PCROP (used for OPTIONBYTE_PCROP).
//                                    This parameter must be a combination of @ref FLASH_OB_PCROP_ZONE
//                                    and @ref FLASH_OB_PCROP_RDP. Note that once set, Pcrop erase on RDP level 1 regression
//                                    (PCROP_RDP bit) can not be reset. It will be reset by mass erase */
//   uint32_t PCROP1AStartAddr;  /*!< PCROP Start address (used for OPTIONBYTE_PCROP). It represents first address of start block
//                                    to protect. Make sure this parameter is multiple of PCROP granularity: 512 Bytes.*/
//   uint32_t PCROP1AEndAddr;    /*!< PCROP End address (used for OPTIONBYTE_PCROP). It represents first address of end block
//                                    to protect. Make sure this parameter is multiple of PCROP granularity: 512 Bytes.*/
//   uint32_t PCROP1BStartAddr;  /*!< PCROP Start address (used for OPTIONBYTE_PCROP). It represents first address of start block
//                                    to protect. Make sure this parameter is multiple of PCROP granularity: 512 Bytes.*/
//   uint32_t PCROP1BEndAddr;    /*!< PCROP End address (used for OPTIONBYTE_PCROP). It represents first address of end block
//                                    to protect. Make sure this parameter is multiple of PCROP granularity: 512 Bytes.*/
// #if defined(FLASH_DBANK_SUPPORT)
//   uint32_t PCROP2AStartAddr;  /*!< PCROP Start address (used for OPTIONBYTE_PCROP). It represents first address of start block
//                                    to protect. Make sure this parameter is multiple of PCROP granularity: 512 Bytes.*/
//   uint32_t PCROP2AEndAddr;    /*!< PCROP End address (used for OPTIONBYTE_PCROP). It represents first address of end block
//                                    to protect. Make sure this parameter is multiple of PCROP granularity: 512 Bytes.*/
//   uint32_t PCROP2BStartAddr;  /*!< PCROP Start address (used for OPTIONBYTE_PCROP). It represents first address of start block
//                                    to protect. Make sure this parameter is multiple of PCROP granularity: 512 Bytes.*/
//   uint32_t PCROP2BEndAddr;    /*!< PCROP End address (used for OPTIONBYTE_PCROP). It represents first address of end block
//                                    to protect. Make sure this parameter is multiple of PCROP granularity: 512 Bytes.*/
// #endif /* FLASH_DBANK_SUPPORT */
// #endif /* FLASH_PCROP_SUPPORT */
// #if defined(FLASH_SECURABLE_MEMORY_SUPPORT)
//   uint32_t BootEntryPoint;    /*!< Allow to force a unique boot entry point to Flash or system Flash */
//   uint32_t SecSize;           /*!< This parameter defines securable memory area width in number of pages starting from Flash base address.
//                                    This parameter must be a value between [0] and [FLASH_PAGE_NB],
//                                    [0] meaning no secure area defined, [1] meaning first page only protected, etc... */
// #if defined(FLASH_DBANK_SUPPORT)
//   uint32_t SecSize2;           /*!< This parameter defines securable memory area width in number of pages starting from 2nd Bank start address.
//                                    This parameter must be a value between [0] and [FLASH_PAGE_NB],
//                                    [0] meaning no secure area defined, [1] meaning first page only protected, etc... */
// #endif /* FLASH_SECURABLE_MEMORY_SUPPORT */
// #endif /* FLASH_DBANK_SUPPORT */
// } FLASH_OBProgramInitTypeDef;

/**
  * @brief  FLASH handle Structure definition
  */
// typedef struct
// {
//   HAL_LockTypeDef   Lock;              /* FLASH locking object */
//   uint32_t          ErrorCode;         /* FLASH error code */
//   uint32_t          ProcedureOnGoing;  /* Internal variable to indicate which procedure is ongoing or not in IT context */
//   uint32_t          Address;           /* Internal variable to save address selected for program in IT context */
//   uint32_t          Banks;             /* Internal variable to save current bank selected during erase in IT context */
//   uint32_t          Page;              /* Internal variable to define the current page which is erasing in IT context */
//   uint32_t          NbPagesToErase;    /* Internal variable to save the remaining pages to erase in IT context */
// } FLASH_ProcessTypeDef;

/**
  * @}
  */

/* Exported constants --------------------------------------------------------*/
/** @defgroup FLASH_Exported_Constants FLASH Exported Constants
  * @{
  */
/** @defgroup FLASH_Keys FLASH Keys
  * @{
  */
#define FLASH_KEY1                      0x45670123U   /*!< Flash key1 */
#define FLASH_KEY2                      0xCDEF89ABU   /*!< Flash key2: used with FLASH_KEY1
                                                           to unlock the FLASH registers access */
#define FLASH_OPTKEY1                   0x08192A3BU   /*!< Flash option byte key1 */
#define FLASH_OPTKEY2                   0x4C5D6E7FU   /*!< Flash option byte key2: used with FLASH_OPTKEY1
                                                           to allow option bytes operations */
/**
  * @}
  */

/** @defgroup FLASH_Latency FLASH Latency
  * @{
  */
#define FLASH_LATENCY_0                 0x00000000UL        /*!< FLASH Zero wait state */
#define FLASH_LATENCY_1                 FLASH_ACR_LATENCY_0 /*!< FLASH One wait state */
#define FLASH_LATENCY_2                 FLASH_ACR_LATENCY_1 /*!< FLASH Two wait states */
/**
  * @}
  */

